[Timeout] BlockStatement
app/gilded-rose.ts:6:38
   sellIn: number;
   quality: number;
 
-  constructor(name, sellIn, quality) {
-    this.name = name;
-    this.sellIn = sellIn;
-    this.quality = quality;
-  }
+  constructor(name, sellIn, quality) {}
 }
 

[Timeout] ConditionalExpression
app/gilded-rose.ts:21:21
   }
 
   updateQuality() {
-    for (let i = 0; i < this.items.length; i++) {
+    for (let i = 0; false; i++) {
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {

[Killed] ConditionalExpression
app/gilded-rose.ts:22:11
 
   updateQuality() {
     for (let i = 0; i < this.items.length; i++) {
-      if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
+      if (true) {
         if (this.items[i].quality > 0) {
           if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
killedBy: Gilded Rose should update quality
statusReason: Error: Files do not match.: 
Approved: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_quality.approved.txt
Received: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_qual

[Killed] ConditionalExpression
app/gilded-rose.ts:22:11
 
   updateQuality() {
     for (let i = 0; i < this.items.length; i++) {
-      if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
+      if (true && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {
           if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
killedBy: Gilded Rose should update quality
statusReason: Error: Files do not match.: 
Approved: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_quality.approved.txt
Received: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_qual

[Killed] BlockStatement
app/gilded-rose.ts:29:41
           }
         }
       } else {
-        if (this.items[i].quality < 50) {
-          this.items[i].quality = this.items[i].quality + 1
-          if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].sellIn < 11) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1
-              }
-            }
-            if (this.items[i].sellIn < 6) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1
-              }
-            }
-          }
-        }
+        if (this.items[i].quality < 50) {}
       }
       if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
killedBy: Gilded Rose should update quality
statusReason: Error: Files do not match.: 
Approved: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_quality.approved.txt
Received: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_qual

[Killed] ConditionalExpression
app/gilded-rose.ts:31:15
       } else {
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1
-          if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
+          if (false) {
             if (this.items[i].sellIn < 11) {
               if (this.items[i].quality < 50) {
killedBy: Gilded Rose should update quality
statusReason: Error: Files do not match.: 
Approved: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_quality.approved.txt
Received: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_qual

[Killed] BlockStatement
app/gilded-rose.ts:31:82
       } else {
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1
-          if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].sellIn < 11) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1
-              }
-            }
-            if (this.items[i].sellIn < 6) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1
-              }
-            }
-          }
+          if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {}
         }
       }
killedBy: Gilded Rose should update quality
statusReason: Error: Files do not match.: 
Approved: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_quality.approved.txt
Received: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_qual

[Killed] ConditionalExpression
app/gilded-rose.ts:32:17
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1
           if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].sellIn < 11) {
+            if (true) {
               if (this.items[i].quality < 50) {
                 this.items[i].quality = this.items[i].quality + 1
killedBy: Gilded Rose should update quality
statusReason: Error: Files do not match.: 
Approved: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_quality.approved.txt
Received: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_qual

[Killed] BlockStatement
app/gilded-rose.ts:33:47
           this.items[i].quality = this.items[i].quality + 1
           if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
             if (this.items[i].sellIn < 11) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1
-              }
+              if (this.items[i].quality < 50) {}
             }
             if (this.items[i].sellIn < 6) {
killedBy: Gilded Rose should update quality
statusReason: Error: Files do not match.: 
Approved: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_quality.approved.txt
Received: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_qual

[Killed] ConditionalExpression
app/gilded-rose.ts:45:11
           }
         }
       }
-      if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
+      if (true) {
         this.items[i].sellIn = this.items[i].sellIn - 1;
       }
killedBy: Gilded Rose should update quality
statusReason: Error: Files do not match.: 
Approved: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_quality.approved.txt
Received: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_qual

[Killed] BlockStatement
app/gilded-rose.ts:49:48
         this.items[i].sellIn = this.items[i].sellIn - 1;
       }
       if (this.items[i].sellIn < 0) {
-        if (this.items[i].name != 'Aged Brie') {
-          if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].quality > 0) {
-              if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-                this.items[i].quality = this.items[i].quality - 1
-              }
-            }
-          } else {
-            this.items[i].quality = this.items[i].quality - this.items[i].quality
-          }
-        } else {
+        if (this.items[i].name != 'Aged Brie') {} else {
           if (this.items[i].quality < 50) {
             this.items[i].quality = this.items[i].quality + 1
killedBy: Gilded Rose should update quality
statusReason: Error: Files do not match.: 
Approved: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_quality.approved.txt
Received: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_qual

[Killed] BlockStatement
app/gilded-rose.ts:50:82
       }
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != 'Aged Brie') {
-          if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].quality > 0) {
-              if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-                this.items[i].quality = this.items[i].quality - 1
-              }
-            }
-          } else {
+          if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {} else {
             this.items[i].quality = this.items[i].quality - this.items[i].quality
           }
killedBy: Gilded Rose should update quality
statusReason: Error: Files do not match.: 
Approved: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_quality.approved.txt
Received: /Users/bartdenhaak/Documents/intellij/GildedRose-Refactoring-Kata-Bart/TypeScript/.stryker-tmp/sandbox3980275/test/jest/gilded-rose.spec.Gilded_Rose_should_update_qual
